In [2]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
ser1 = Series(np.arange(3), index=['a','b','c'])

In [4]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [6]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [10]:
dframe2 = dframe1.drop('LA')
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [17]:
dframe3 = dframe1.drop('SF',axis=0)
dframe3

    pop  size  year
LA    3     4     5
NY    6     7     8

In [18]:
dframe4 = dframe1.drop('year',axis=1)
dframe4

    pop  size
SF    0     1
LA    3     4
NY    6     7